app/controllers/api/v1/animals_controller.rb

    def create
        animal = AnimalFacade.animal_search(params[:animal][:species]) # External Ninja
        animal = Animal.create(animal_params.merge(
          diet: animal.diet,
          main_prey: animal.main_prey,
          skin_type: animal.skin_type,
          top_speed: animal.top_speed,
          avg_litter: animal.avg_litter,
          lifespan: animal.lifespan,
          fav_food: animal.fav_food,
          habitat: animal.habitat,
          weight: animal.weight,
          lifestyle: animal.lifestyle)) # Creation BE
---
INSERT INTO "animals" ("name", "species", "birthday", "color", "main_prey", "habitat", "diet", "skin_type", "top_speed", "avg_litter", "lifespan", "weight", "lifestyle", "fav_food", "shelter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

    def update
        result = AnimalUpdater.update(params[:id], animal_params)
        # require 'pry'; binding.pry
         # pass to frontend Json
        render json: AnimalSerializer.new(Animal.find_by(id: params[:id]))
---
UPDATE "animals" SET "name" = $1, "top_speed" = $2, "updated_at" = $3 WHERE "animals"."id" = $4  [["name", "Chuck"], ["top_speed", "30 mph"], ["updated_at", "2024-02-22 17:39:05.171517"], ["id", 30]]
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def destroy
        AnimalDestroyer.destroy(params[:id])
---
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 23]]