app/controllers/api/v1/shelters_controller.rb

    def create
        shelter = Shelter.create(shelter_params)
---
INSERT INTO "shelters" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Red Barn"], ["created_at", "2024-02-22 03:31:28.766224"], ["updated_at", "2024-02-22 03:31:28.766224"]]

    def update
        result = ShelterUpdater.update(params[:id], shelter_params)
---
UPDATE "shelters" SET "name" = $1, "updated_at" = $2 WHERE "shelters"."id" = $3  [["name", "Blue Coop"], ["updated_at", "2024-02-22 03:31:28.789941"], ["id", 3]]

    def destroy
        ShelterDestroyer.destroy(params[:id])
---
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 72]]