app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Issac's dad"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-21 17:37:56.500321"], ["updated_at", "2024-02-21 17:37:56.500321"]]
---
    def create
        user = User.create(user_params)